/*
플로럴,0
시트러스 ,1
프루티,2
스모키,3
카라멜,4
너티,5
민트,6
스파이시,7
*/

const qnaList = [
  {
    q: '1. 차를 마실 때, 어떤 향기가 더 매력적으로 느껴지나요?',
    a: [
      { answer: 'a. 꽃잎의 향기와 달콤함이 어우러진 향미가 좋아요.', type: [0] },
      { answer: 'b. 레몬과 오렌지 등의 과일 향기가 상쾌하고 경쾌해서 좋아요.', type: [1] },
      { answer: 'c. 다양한 과일의 맛과 향미를 좋아해요.', type: [2] }
    ]
  },
  {
    q: '2. 차를 마시면서 어떤 기분을 느끼시나요?',
    a: [
  { answer: 'a. 아늑하고 로맨틱한 느낌을 받고 싶어요.', type: [0] },
  { answer: 'b. 상쾌하고 경쾌한 느낌을 원해요.', type: [1] },
  { answer: 'c. 활기차고 즐거운 감정을 느끼고 싶어요.', type: [2] }
]
},
  {
    q: '3. 차를 선택할 때 가장 중요하게 생각하는 요소는 무엇인가요?',
    a: [
      { answer: 'a. 향미와 맛이 가장 중요해요.', type: [0, 1, 2] },
      { answer: 'b. 카페인 함량과 유형이 중요해요.', type: [3, 5] },
      { answer: 'c. 차종과 블랜딩이 가장 중요해요.', type: [4, 6, 7] }
    ]

  },
  {
    q: '4. 차를 마시는 시간대가 주로 언제인가요?',
    a: [
      { answer: 'a. 아침에 마시는 차가 제일 좋아요.', type: [0, 1,2] },
      { answer: 'b. 오후에 한잔의 차가 가장 기분 좋아요.', type: [4, 6, 7] },
      { answer: 'c. 저녁이나 취침 전에 마시는 차를 좋아해요.', type: [3, 5] }
    ]
  },
  {
    q: '5. 어떤 향미의 차를 마시면서 기분이 좋아지나요?',
    a: [
      { answer: 'a. 달콤하고 우아한 향미가 기분을 편안하게 만들어줘요.', type: [0, 4] },
      { answer: 'b. 상쾌하고 경쾌한 향미가 기분을 상쾌하게 만들어줘요.', type: [1, 6] },
      { answer: 'c. 다양한 과일의 향미가 기분을 활기차게 만들어줘요.', type: [2] }
    ]

  },

  {
    q: '6. 차를 마시면서 어떤 감정을 느끼고 싶으신가요?',
    a: [
      { answer: 'a. 로맨틱한 감성을 느끼고 싶어요.', type: [0,4] },
      { answer: 'b. 스트레스를 날려주는 상쾌한 감정을 느끼고 싶어요.', type: [2, 6] },
      { answer: 'c. 즐거움과 기쁨을 느끼고 싶어요.', type: [0, 4, 6, 7] }
    ]

  },
  {
    q: '7. 차의 재료에 대해 특별히 중요하게 생각하는 것이 있나요?',
    a: [
      { answer: 'a. 유기농 재료가 사용된 차를 선호해요.', type: [0,1, 2] },
      { answer: 'b. 특정 허브나 재료가 포함된 차를 원해요.', type: [4, 6, 7] },
      { answer: 'c. 차의 재료에는 별다른 선호가 없어요.', type: [3, 5] }
    ]

  },
  {
    q: '8. 차를 마시면서 특별한 경험을 원하시나요?',
    a: [
      { answer: 'a. 우아하고 특별한 경험을 원해요.', type: [0, 4] },
      { answer: 'b. 경쾌하고 활기찬 경험을 원해요.', type: [1, 6] },
      { answer: 'c. 다양한 맛과 향을 즐기며 색다른 경험을 원해요.', type: [2, 3, 5, 7] }
    ]

  },
  {
    q: '9. 차를 마시는 목적은 무엇인가요?',
    a: [
      { answer: 'a. 휴식과 여유를 찾으려고 마시는 편이에요.', type: [0, 1, 2] },
      { answer: 'b. 에너지를 충전하거나 집중력을 높이기 위해 차를 선택해요.', type: [3, 5] },
      { answer: 'c. 다이어트나 건강에 좋은 차를 찾아요.', type: [4, 6, 7] }
    ]

  },
  {
    q: '10. 어떤 차를 마시면서 특별한 순간을 보내고 싶으신가요?',
    a: [
  { answer: 'a. 특별한 기념일이나 데이트를 위해 특별한 차를 선택해요.', type: [0, 4] },
  { answer: 'b. 일상적인 시간에도 특별함을 느낄 수 있는 차를 선택해요.', type: [1, 6] },
  { answer: 'c. 차를 마시며 평범한 순간도 특별하게 만들고 싶어요.', type: [1,3, 5, 7] }
]

},
  {
    q: '11. 차를 마시면서 어떤 색다른 향미를 경험해보고 싶으신가요?',
    a: [
      { answer: 'a. 로맨틱한 기분좋은 향미가 담긴 차를 원해요.', type: [0] },
      { answer: 'b. 상쾌한 향미가 담긴 차를 원해요.', type: [1] },
      { answer: 'c. 독특하고 특별한 향미가 담긴 차를 원해요.', type: [8] }
    ]

  },
    /*
  {
    q: '더운여름 시원한 음료가 마시고 싶을때 생각나는 음료는 ?',
    a: [
  { answer: 'a.상큼하고 청량한 레몬에이드 .', type: ['acidity'] },
  { answer: 'b.달콤한 아이스초코 .', type: ['savoy'] },
  { answer: 'c.깊은맛의 시원한 아이스 홍차.', type: ['bitter '] }
]
},
  {
    q:'나만의홈카페타임 내가만들고싶은차는???',
    a: [
  { answer: 'a.오랜시간 우려내 시원하게 마신다.', type: ['cold brew'] },
  { answer: 'b따뜻하게 우려내 여유롭고 깊은 향미를 느끼며 마신다.', type: ['hot infusion'] },
  { answer: 'c.우유, 술, 등을 추가하여 다양하고 독특하게 즐긴다.', type: ['variation'] }
  ]
  }*/
]
  
  const infoList = [
    {
      name: '플로럴 (꽃의 아름다움을 즐기는 타입)',
      desc: "당신은 꽃의 아름다움과 우아함을 느끼며 차에 접근합니다. 꽃잎의 향기와 달콤함이 어우러진 다양한 차를 즐겨보세요. 마음이 따뜻해지고 로맨틱한 느낌을 받을 수 있어요. 이 차는 마시면 마치 밀크와 허니가 어우러진 데이트처럼 감미로운 풍미를 느낄 수 있습니다!"
    },
    {
      name: '시트러스 (후각을 자극하는 상쾌한 타입)',
      desc: '당신은 상쾌한 맛이 나는 차를 선호하는 스타일입니다. 오렌지껍질에서 느낄 수 있는 향미의 차는 독특하고 상큼한 향기를 가지고 있어 차를 마시면 마음이 상쾌해지고 기분 좋은 느낌을 받을 수 있어요. 이 차는 마시는 순간 마치 얼음수로 샤워를 받는 것 같은 상쾌함을 선사해 줍니다! '
    },
    {
      name: '프루티 (다양한 과일의 맛과 향에 호기심 있는 타입)',
      desc: '당신은 다양한 과일의 맛과 향에 호기심이 많으며, 차에도 그 다양성을 즐기고 싶어합니다. 망고, 파인애플, 베리 등 다양한 과일을 활용한 차를 즐겨보세요. 청량감과 달콤함이 어우러져 하루를 활기차게 만들어 줄 거에요. 이 차는 마시면 마치 산뜻한 여름휴가를 보내는 것 같은 상쾌함을 선사합니다!'
    },
    {
      name: '스모키 (대담하고 독특한 맛을 즐기는 타입)',
      desc: '당신은 대담하고 독특한 취향을 가지고 있으며, 고전적인 맛보다는 독특한 향과 맛을 즐기는 타입입니다. 고소하고 풍부한 맛을 선사해주며, 깊은 향미로 마음을 끌어들이고 독특하고 특별한 경험을 선물해 줄 거에요. 이 차는 마시면 마치 대담한 모험을 떠난 것 같은 진한 맛과 풍미를 느낄 수 있습니다!'
    },
    {
      name: '카라멜 (달콤한 감미로움을 즐기는 타입)',
      desc: '당신은 달콤한 감미로움과 부드러움을 즐기는 스타일입니다. 당신이 좋아하는 차는 달콤하고 풍부한 맛을 가지며, 마시는 즐거움을 더해줍니다. 이러한 향미는 행복한 감성을 자극하여 기분이 상쾌하고 포근한 느낌을 줄 거에요. 이 차는 마시면 마치 어린 시절의 달콤한 과자를 먹고 있는 것 같은 따뜻한 기분을 선사합니다!'
    },
    {
      name: '너티 (차의 본연의 풍미와 깊은 맛을 즐기는 타입)',
      desc: '당신은 차의 본연의 풍미와 깊은 맛을 즐기는 건강한 스타일입니다. 깊고 진한 향과 맛으로 기분을 안정시켜주며, 마음이 차분해지고 몸과 마음이 편안해지는 느낌을 받을 거에요. 이 차는 마시면 마치 아늑한 숲속에서 산책하는 것 같은 평온함과 편안함을 선사합니다!'
    },
    {
      name: '민트 (상쾌하고 청량한 느낌을 즐기는 타입)',
      desc: '당신은 상쾌하고 청량한 느낌을 즐기며, 차에도 신선함과 활력을 찾는 스타일입니다. 이러한 차는 상쾌한 향과 시원한 맛으로 기분을 활기차게 만들어주고 산뜻한 느낌을 느끼게 해줄거에요. 이 차는 마시면 마치 시원한 바람이 부는 산 야외에서 활력을 느끼는 것 같은 청량함을 선사합니다!'
    },
    {
      name: '스파이시 (독특한 맛과 향미를 즐기는 타입)',
      desc: '당신은 독특하고 특별한 맛을 찾는 모험적인 스타일입니다. 향과 맛이 풍부하고 독특한 차는 감각적인 즐거움을 선사해줍니다. 이 차는 특별한 경험과 색다른 느낌을 줄 거에요. 이 차는 마시면 마치 신비로운 마법의 물약을 마시는 것 같은 신기하고 특별한 맛과 향미를 느낄 수 있습니다!'
    }
  ]